Store/src/AccumulationRegisters/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Товары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Store/src/AccumulationRegisters/Товары/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция, которая получит остатки по номенклатуре и вернет из в виде соответствия где ключ - Склад
// , а значение Номенклатура
//
// Параметры:
//  Номенклатура - Массив Из СправочникСсылка.Номенклатура - номенклатура, по которой будет получен остаток
// 
// Возвращаемое значение:
//  Соответствие Из Строка - где ключ - Склад, а значение - Соответствие с Ключем - Номенклатура, Значение - Количество
//
Функция ОстаткиПоНоменклатуре(Номенклатура) Экспорт

	Соответствие = Новый Соответствие;
	Для Каждого НоменклатураДляЗапроса Из Номенклатура Цикл
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТоварыОстатки.Склад КАК Склад,
			|	ТоварыОстатки.Номенклатура КАК Номенклатура,
			|	ТоварыОстатки.КоличествоОстаток КАК КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.Товары.Остатки(, Номенклатура = &Номенклатура) КАК ТоварыОстатки
			|
			|УПОРЯДОЧИТЬ ПО
			|	Склад";
	
		Запрос.УстановитьПараметр("Номенклатура", НоменклатураДляЗапроса);
	
		РезультатЗапроса = Запрос.Выполнить();
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОстаткиПоСкладу = Соответствие.Получить(ВыборкаДетальныеЗаписи.Склад);
			Если ОстаткиПоСкладу = Неопределено Тогда
				ОстаткиПоСкладу = Новый Соответствие;
			КонецЕсли;
			ОстаткиПоСкладу.Вставить(ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.КоличествоОстаток);
			Соответствие.Вставить(ВыборкаДетальныеЗаписи.Склад, ОстаткиПоСкладу);
		КонецЦикла;

	КонецЦикла;
	
	Возврат Соответствие;
	
	ИмяПользователя = "Вася";
	Время = "День";
	Строка = СтрШаблон("Добрый %1! %2, как дела?", Время, ИмяПользователя);

	
	
КонецФункции

#КонецОбласти

#КонецЕсли
